----------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Harris\projects\asmhi_programming\analysis/do/stata_practical_4.log
  log type:  text
 opened on:   7 Oct 2021, 11:24:01

. // d) Load your data from previous practical's saved mydata2.dta 
. use "data/processed/mydata2.dta"

. 
. // Question 2: Data assumptions  
. 
. // a) For ghq12 total, bmi and age at interview check the distribution of your data by using
>  the summarize, histogram and qnorm commands. Use the help files to make use of options to f
> ormat your plots.  
. 
. local vars ghq_total bmi age

. 
. * (i)
. summarize `vars'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   ghq_total |         27    18.66667    4.922476         10         29
         bmi |         31    26.62715    1.290462   24.14773   30.15625
      age_fi |         32    28.34375    7.494554         17         45

. 
. foreach v of local vars {
  2.         
.         * (ii) histogram
.         histogram `v', name("histo_`v'", replace) title("Histogram of `v'")
  3.         
.         * (iii) qnorm
.         qnorm `v', name("qnorm_`v'", replace) title("Normality plot of `v'")
  4. }
(bin=5, start=10, width=3.8)
(bin=5, start=24.147728, width=1.2017044)
(bin=5, start=17, width=5.6)

. 
. * combine all
. #delim ;
delimiter now ;
. graph combine 
> histo_ghq_total histo_bmi histo_age
> qnorm_ghq_total qnorm_bmi qnorm_age,
> rows (2) name(q2a, replace);

. #delim cr
delimiter now cr
. 
. // b) For ethnicity and sex check the distribution of your data by using the tabulate comman
> d
. tabulate ethnicity sex, cell

+-----------------+
| Key             |
|-----------------|
|    frequency    |
| cell percentage |
+-----------------+

           |          sex
 ethnicity |      Male     Female |     Total
-----------+----------------------+----------
     White |         3          4 |         7 
           |      9.09      12.12 |     21.21 
-----------+----------------------+----------
     Black |         3          4 |         7 
           |      9.09      12.12 |     21.21 
-----------+----------------------+----------
     Asian |         4          4 |         8 
           |     12.12      12.12 |     24.24 
-----------+----------------------+----------
     Mixed |         4          3 |         7 
           |     12.12       9.09 |     21.21 
-----------+----------------------+----------
     Other |         2          1 |         3 
           |      6.06       3.03 |      9.09 
-----------+----------------------+----------
       888 |         0          1 |         1 
           |      0.00       3.03 |      3.03 
-----------+----------------------+----------
     Total |        16         17 |        33 
           |     48.48      51.52 |    100.00 

. 
. 
. // Question 3: Repeat question 2 but split the data by treatment allocation to look for diff
> erences in each population. Hint: use bysort, by and if options 
. 
. bysort treatment: summarize `vars'

----------------------------------------------------------------------------------------------
-> treatment = 0

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   ghq_total |         14    18.42857    5.529144         10         28
         bmi |         15    26.61315    1.086833   25.11477   29.19184
      age_fi |         17    26.52941    7.575599         18         45

----------------------------------------------------------------------------------------------
-> treatment = 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   ghq_total |         13    18.92308    4.386752         12         29
         bmi |         16    26.64026    1.492563   24.14773   30.15625
      age_fi |         15        30.4    7.089227         17         39


. 
. foreach v of local vars {
  2.         * (ii) histogram
.         histogram `v', ///
>                 by(treatment) ///
>                 name("histo_`v'_byTrt", replace)
  3.         
.         * (iii) qnorm, see Q4 for alternative
.         
.         * qnorm `v' if treatment == 0, name("qnorm_`v'_byTrt0", replace)
.         * qnorm `v' if treatment == 1, name("qnorm_`v'_byTrt1", replace)
. }

. 
. 
. // Question 4: 
. // You will have noticed from question 3 you cannot use the by option for a qnorm plot so th
> ey appear in separate plots. Use the graph combine command to see them in the same plot. (Hi
> nt: make sure you have saved your plots in order to recall them in the graph combine command
> ) 
. 
. local vars ghq_total bmi age

. 
. foreach v of local vars {
  2.         
.         * reset at the start of each loop
.         local graphs
  3.         levelsof treatment, local(trt_levels)
  4.         
.         foreach l of local trt_levels {
  5.                 tempname graph
  6.                 qnorm `v' if treatment == `l', ///
>                         name(`graph') title("treatment (`l')")
  7.                 local graphs `graphs' `graph'
  8.         }
  9.         graph combine `graphs', ///
>                 name("qnorm_`v'_byTrt", replace) ///
>                 title("Qnorm of `v' by treatment")
 10.                                         
. }
0 1
0 1
0 1

. 
. 
. // Question 5: Scatter plot 
. 
. // a) Produce a scatter plot for weight vs height 
. graph twoway ///
>         (scatter weight height), ///
>         name("p5a", replace)

. 
. // b) Add axis titles, title and a line of best fit 
. graph twoway ///
>         (scatter weight height) ///
>         (lfit weight height), ///
>         legend(off) ///
>         name("p5b", replace) ///
>         title("Scatterplot of weight against height") ///
>         ytitle("Weight (kg)") ///
>         xtitle("Height (m)")

. 
. // c) Add a sentence to your do file interpreting this plot 
. 
. // Question 6: reproducibility of work  
. 
. // a) Close your log file and have a look at it, it will be found where you specified your w
> orking directory as a .smcl or .log file. 
. log close
      name:  <unnamed>
       log:  C:\Users\Harris\projects\asmhi_programming\analysis/do/stata_practical_4.log
  log type:  text
 closed on:   7 Oct 2021, 11:24:19
----------------------------------------------------------------------------------------------
